doom.d/config.org
#+TITLE: Justyn's Doom Config

* TOC :TOC_3_gh:
- [[#references][References]]
  - [[#example-doom-literate-configs][Example Doom literate configs]]
  - [[#doomcasts][Doomcasts]]
- [[#things-i-need-to-work-on][Things I need to work on]]
- [[#doom-specific-config][Doom-specific Config]]
  - [[#default-doom-configel][Default Doom config.el]]
  - [[#open-which-key-popup-quicker][Open which-key popup quicker]]
- [[#packages][Packages]]
  - [[#powerthesaurus][Powerthesaurus]]
  - [[#string-inflection][string-inflection]]
- [[#org-mode][Org Mode]]
  - [[#general][General]]
  - [[#org-directories][Org Directories]]
  - [[#org-structure-template-shortcuts][Org Structure Template shortcuts]]
  - [[#org-agenda][Org Agenda]]
    - [[#general-settings][General settings]]
    - [[#org-todo-keywords][Org todo keywords]]
    - [[#custom-commands-and-agenda-views][Custom Commands and Agenda views]]
    - [[#org-clock][org-clock]]
  - [[#org-capture-templates][Org Capture Templates]]
- [[#keybindings][Keybindings]]
  - [[#useful-keybinding-reminders][Useful keybinding reminders]]
    - [[#convert-lists-between-orderednumbereunordered][Convert Lists between ordered/numbere/unordered]]
  - [[#keybindings-from-spacemacs][Keybindings from Spacemacs]]
    - [[#more-keybindings-from-spacemacs][More keybindings from spacemacs]]
  - [[#misc-keybindings][Misc Keybindings]]
  - [[#navigation][Navigation]]
- [[#display][Display]]
  - [[#window-size-and-position][Window Size and Position]]
  - [[#font-and-font-sizing][Font and font sizing]]
  - [[#theme][Theme]]
  - [[#move-to-new-split-windows][Move to new split windows]]
- [[#editing][Editing]]
  - [[#tabs-vs-spaces][Tabs vs Spaces]]
  - [[#refresh-buffer-on-external-file-changes][Refresh buffer on external file changes]]
- [[#version-control][Version Control]]
  - [[#magit][magit]]
  - [[#treemacs-magit][treemacs-magit]]
- [[#projectile][Projectile]]
- [[#tramp][Tramp]]
- [[#tags][Tags]]
- [[#evil-snipe][evil-snipe]]
- [[#backups-and-history][Backups and history]]
- [[#hydra-paste][Hydra Paste]]
- [[#avy][Avy]]

* References

** Example Doom literate configs

Found and referenced several of these while working on updating my config.

- https://gitlab.com/justinekizhak/dotfiles/blob/master/emacs/doom.d/config.org
- https://noelwelsh.com/posts/2019-01-10-doom-emacs.html
- https://github.com/nmartin84/.doom.d/blob/master/config.org
- https://www.reddit.com/r/emacs/comments/empzmz/doom_emacs_literate_config/
- https://github.com/martinbaillie/dotfiles/blob/master/config/emacs/config.org

** Doomcasts

These videos are a good intro to doom emacs and some of the common features.
https://www.youtube.com/watch?v=ywRExNOyybY&list=PLhXZp00uXBk4np17N39WvB80zgxlZfVwj&index=6

* Things I need to work on

Stuff I need to figure out for doom-emacs config

- [X] smart paste - In spacemacs, I can press =p= and then =C-j= and =C-k= to cycle between different kill rings
- [ ] Try [[https://github.com/bastibe/annotate.el][annotate mode]] like in [[https://gitlab.com/justinekizhak/dotfiles/blob/master/emacs/doom.d/config.org][this config]]
- [ ] Use gpg for all of my org files? (Wouldnt be able to access on android anymore though)
- [ ] Make more of a cheatsheet/reference for common keybindings
- [ ] Setup deft?
- [ ] Setup org-clock and my helper functions for it
- [ ] Setup and test lsp for terraform and python
- [ ] ctrl+enter doesn't work to add to lists in a terminal
- [ ] make =SPC /= work for searching project



* Doom-specific Config

Config related to Doom itself, or packages I probably wouldn't use if Doom wasn't using it.  This should also be the first section of my config and get added to the top of the file.

** Default Doom config.el

This is what came in config.el when it first got generated.  I've moved some of it into other sections where it makes sense.  Eventually I'll move everything out.

#+BEGIN_SRC emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!

;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Justyn Shull"
      user-mail-address "john@doe.com")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'doom-one)


;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)


;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
#+END_SRC
** Open which-key popup quicker

#+BEGIN_SRC emacs-lisp
(setq which-key-idle-delay 0.25)
#+END_SRC
* Packages

I think I can split this up into other sections throughout the file, but I'm just leaving it here for now.

TODO: Tangle this to packages.el
#+BEGIN_SRC emacs-lisp

#+END_SRC
** Powerthesaurus

[[https://github.com/SavchenkoValeriy/emacs-powerthesaurus][Powerthesaurus]], use =SPC a p= to look up a synonym for the word at the cursor.

#+BEGIN_SRC elisp
(use-package! powerthesaurus
  :defer t)
(map! :leader
      (:prefix ("a" . "applications")
               :desc "Use powerthesaurus to fetch better word" "p" #'powerthesaurus-lookup-word-dwim))
#+END_SRC
** string-inflection

[[https://github.com/akicho8/string-inflection][string-inflection]], use =SPC a c= to cycle a word like this:
emacs_lisp => EMACS_LISP => EmacsLisp => emacsLisp => emacs-lisp => Emacs_Lisp => emacs_lisp

#+BEGIN_SRC elisp
(use-package! string-inflection
  :defer t)
(map! :leader
      (:prefix ("a" . "applications")
               :desc "Cycle through string case using String-inflection" "c" #'string-inflection-all-cycle))
#+END_SRC
* Org Mode
TODO:

- [ ] org-mru-clock
- [ ] org-capture and templates
- [ ] org-clock
- [ ] org-agenda
- [ ] org-habit
- [ ] org-expiry
- [ ] org-download (and screenshots)
- [ ] fold on startup
- [ ] shortcut for creating sparse tree from headers (Zaiste uses =SPC / s=, but I want =SPC /= for search in project)
- [ ] shortcut for creating sparse tree of tags (^ =SPC / t=)

** General

General settings that I don't know how to categorize yet.

#+BEGIN_SRC emacs-lisp
(after! org
  ;; Default Column View
  (setq org-columns-default-format "%5TODO %30ITEM(Task) %10Effort(Effort){:} %10CLOCKSUM(Clocked) %3PRIORITY(PRI) %TAGS")

  ;; Enable speed commands for single-key commands at the beginning of headers.  ? for help  TODO: I don't really know what these do
  (setq org-use-speed-commands t)
  ;; Prettier code blocks
  (setq org-src-fontify-natively t)
  ;; Hide code blocks by default in org-mode
  '(org-hide-block-startup t)
  )
#+END_SRC

