doom.d/config.org
** Org Capture Templates

#+BEGIN_SRC elisp
(setq org-capture-templates
      ;; TODO: Move some of these to a separate file not in git, since I don't need them in every computer
      '(("t" "Todo" entry (file+headline "~/org/TODO.org" "Tasks")
         "* TODO %?\nCREATED: %U\n%i\n%a")
        ("T" "Todo with Clipboard" entry (file+headline "~/org/TODO.org" "Tasks")
         "* TODO %?\nCREATED: %U\n%c"
         :empty-lines 1)
        ("r" "Read Later" entry (file+headline "~/org/TODO.org" "Read Later")
         "* TODO %?  :readlater:\nCREATED: %U")
        ("j" "Journal"
         entry (file+datetree "~/org/journal.org")
         "* %? \nCREATED: %U\n%i\n%a"
         :empty-lines 1)
        ;; TODO: Use year in filename automatically
        ("w" "New WorkLog entry"
         entry (file+datetree "~/org/worklog_2020.org")
         "* %? :work:\nCREATED: %T\n%i\n%a\n"
         :clock-in t
         :clock-resume t
         :empty-lines 1)
        ("W" "New Work Ticket"
         entry (file+datetree "~/org/worklog_2020.org")
         "* IN-PROGRESS %^{TicketID}: %^{Title} :work:ticket:
:PROPERTIES:
:ID: %\\1
:BI_ENVIRONMENT: %^{BI_ENVIRONMENT}
:BI_CUSTOMER: %^{BI_CUSTOMER}
:CREATED: %T
:END:\n%?"
         :clock-in t
         :clock-resume t
         :empty-lines 1)
        ("n" "Append timestamped note to clocked task"
         plain (clock)
         "%U %?"
         :empty-lines 1)
        ("m" "Meeting"
         entry (file+datetree "~/org/worklog_2020.org")
         "* Meeting for %^{Title} :work:meeting:\nCREATED: %T\nAgenda/Purpose: \nWho: \n\n - %?\n"
         :empty-lines 1
         :clock-in t
         :clock-resume t)
        ("M" "Adhoc Meeting(Chat/InPerson/Email/Etc)"
         entry (file+datetree "~/org/worklog_2020.org")
         "* Adhoc meeting w/ %^{Who} about %^{What} :work:meeting:\nCREATED: %T\nWho: %\\1 \nNotes: %?\n"
         :empty-lines 1
         :clock-in t
         :clock-resume t)
        ("f" "Todo - Follow-up later today on e-mail/slack/etc"
         entry (file+datetree "~/org/worklog_2020.org")
         "* NEXT [#A] %? :work:followup:\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\")) CREATED: %T\n"
         :empty-lines 1)
        ("v" "Code Reference with Comments to Current Task"
         plain (clock)
         "%?\n%(ha/org-capture-code-snippet \"%F\")\n\n"
         :empty-lines 1)
        ("V" "Link to Code Reference to Current Task"
         plain (clock)
         "%(ha/org-capture-code-snippet \"%F\")"
         :empty-lines 1 :immediate-finish t)
        ))
#+END_SRC

* Keybindings

Helpful tip, use =SPC ?= to see a list of all available keybindings.

This [[https://rameezkhan.me/adding-keybindings-to-doom-emacs/][blog post]] helped me to figure out how to add new keybindings for doom-emacs. Also see [[https://github.com/hlissner/doom-emacs/blob/develop/modules/config/default/+evil-bindings.el][evil-bindings.el]] for additional examples.

** Useful keybinding reminders

TODO: I'll probably want to sort this into categories eventually.

| Key       | What                                                               |
| =SPC ,=   | Switch to another buffer in the current project                    |
| =SPC b b= | ^                                                                  |
| =SPC <=   | Show/switch to all buffers in a session                            |
| =SPC b B= | ^                                                                  |
| =SPC `=   | Switch to the last used buffer (=SPC b TAB= in spacemacs)          |
| =SPC b l= | ^                                                                  |
| =SPC o p= | Open treemacs in the project sidebar                               |
| =C-w w=   | Cycle through open windows                                         |
| =SPC 0=   | Go to the window to the left                                       |
| =SPC 1=   | Go to the window to the right                                      |
| =R=       | evil-multiedit - Select all matches at once                        |
| =M-d=     | evil-multiedit - start multicursor, keep pressing to expand search |

*** Convert Lists between ordered/numbere/unordered

If you have a list like this:

- item 1
- item 2
- item 3

You can change the - on the first item to a + or =1.= and then press =C-c C-c= and the rest of the list will automatically be updated to a numbered list.


** Keybindings from Spacemacs

I keep trying to use these key shortcuts, so re-bind them to work in Doom.

See these links for some discussion around this:

- https://github.com/hlissner/doom-emacs/issues/2542
- https://github.com/hlissner/doom-emacs/issues/940
- https://github.com/chenyanming/spacemacs_module_for_doom
  - This module can be loaded to include a lot of spacemacs default functionality and keymaps, but I'd rather keep my config limited to what I actually need/want (on top of Doom)

I'm used to using =SPC N= to switch to window N, and use some other =SPC w ...= keys pretty often.
#+BEGIN_SRC emacs-lisp
;; TODO: I'm not sure how to go to a specific window, so this really just goes left and right for now
(map! :leader
      (:desc "Window left" "1" #'evil-window-left
       :desc "Window right" "2" #'evil-window-right))
(map! :leader
      (:prefix ("w" . "window")
               (:desc "Window left" "1" #'evil-window-left
                :desc "Window right" "2" #'evil-window-right
                :desc "evil-window-vsplit" "|" #'evil-window-vsplit)))
#+END_SRC
*** TODO More keybindings from spacemacs

These are all from =SPC 0= which is "custom" for Spacemacs.  Doom uses it for "open" by default.  I'm not sure whether there's an equivalent to "custom" for doom that doom won't override.

- [ ] o == custom
- [ ] op = punch-in
- [ ] oP = punch-out
- [ ] oC = calculator
- [ ] oc = org-mru-clock-in
- [ ] os = org-save-all-org-buffers
- [ ] oq = auto-fill-mode
** Misc Keybindings

#+BEGIN_SRC emacs-lisp
;; Select-all
(map! "M-a" #'mark-whole-buffer)
;; Save
(map! "M-s" #'save-buffer)
;; Paste menu
(map! "M-v" #'counsel-yank-pop)
#+END_SRC

** Navigation

Use Control + hjkl to move around windows in a frame.

#+BEGIN_SRC emacs-lisp
(map!
 :n "C-h" #'evil-window-left
 :n "C-j" #'evil-window-down
 :n "C-k" #'evil-window-up
 :n "C-l" #'evil-window-right
 )
#+END_SRC

The above only works in normal mode.  We have to add the same mapping for the treemacs mode.

#+BEGIN_SRC emacs-lisp
(map!
 (:map evil-treemacs-state-map
       "C-h" #'evil-window-left
       "C-l" #'evil-window-right)
 )
#+END_SRC

* Display
** Window Size and Position

This is from https://github.com/hlissner/doom-emacs/blob/develop/docs/api.org#center-emacs-initial-frame-with-a-fixed-size
#+BEGIN_SRC emacs-lisp
;; On startup, restore the last-used window size and position
(when-let (dims (doom-store-get 'last-frame-size))
  (cl-destructuring-bind ((left . top) width height fullscreen) dims
    (setq initial-frame-alist
          (append initial-frame-alist
                  `((left . ,left)
                    (top . ,top)
                    (width . ,width)
                    (height . ,height)
                    (fullscreen . ,fullscreen))))))

(defun save-frame-dimensions ()
  (doom-store-put 'last-frame-size
                  (list (frame-position)
                        (frame-width)
                        (frame-height)
                        (frame-parameter nil 'fullscreen))))

;; When we kill emacs, save the current window size and position
(add-hook 'kill-emacs-hook #'save-frame-dimensions)
#+END_SRC
** Font and font sizing

TODO: Change font depending on OS?

#+BEGIN_SRC elisp
;; Add a small amount of extra space in between each line
(setq line-spacing 2)
#+END_SRC
** Theme

Lots of doom-specific themes available at https://github.com/hlissner/emacs-doom-themes
Screenshots available at: https://github.com/hlissner/emacs-doom-themes/tree/screenshots

Themes I like so far:

- doom-one - default theme, a little too dark for the comments
- doom-vibrant - almost the same as the default theme, but a little brighter
- doom-horizon - dark, more colorful than vibrant
- doom-tomorrow-night
- doom-material

#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-one)
(load-theme doom-theme t)
#+END_SRC
** Move to new split windows

#+BEGIN_SRC emacs-lisp
(setq evil-split-window-below t
      evil-vsplit-window-right t)
#+END_SRC
* Editing
** Tabs vs Spaces

Use spaces instead of tabs by default, and set the default indent width to 2.  The =editorconfig= package/module should allow this to be overriden per project or repository.

- [ ] TODO:  Some languages like go want to use tabs by default, I should make sure that still happens.
- [ ] TODO:  =tab-width= only affects display, not actual number of spaces afaik

#+BEGIN_SRC elisp
(setq indent-tabs-mode nil
      tab-width 2)
#+END_SRC
** Refresh buffer on external file changes

From https://gitlab.com/justinekizhak/dotfiles/blob/master/emacs/doom.d/config.org - automatically refresh the buffer if a file is changed outside of emacs.

#+BEGIN_SRC elisp
(use-package! autorevert
  :defer t
  :ensure nil
  :config
  (global-auto-revert-mode +1)
  (setq auto-revert-interval 2
        auto-revert-check-vc-info t
        auto-revert-verbose nil))
#+END_SRC

* Version Control
** magit

#+BEGIN_SRC emacs-lisp
;; Set the directory where magit looks for repos in
(setq magit-repository-directories '("~/dev/"))
#+END_SRC

Show gravatars for commit authors
#+BEGIN_SRC emacs-lisp
(setq magit-revision-show-gravatars '("^Author:     " . "^Commit:     "))
#+END_SRC
** treemacs-magit
#+BEGIN_SRC emacs-lisp
(use-package! treemacs-magit
  :defer t
  :after (treemacs magit))
#+END_SRC
* Projectile

Use =SPC p D= to run discover projects in the search path.

This seems to only search one folder deep, so if you use a path of =~/dev= it detects =~/dev/proj1= but it will not detect something like =~/dev/clients/clientA/proj2=.

- [X] TODO: Can I use wildcards somehow?
- [ ] TODO: Discover projects in ~/dev/*/*/* (2 or 3 levels nested)

#+BEGIN_SRC emacs-lisp
;; (setq projectile-project-search-path '("~/dev/" "~/dev/clients/"))
;; Found on https://github.com/bbatsov/projectile/issues/1500
;; TODO: This still isn't recursive more than one level
(setq projectile-project-search-path (cddr (directory-files "~/dev" t)))
#+END_SRC
* Tramp

#+BEGIN_SRC emacs-lisp
;; Use /sshx because /ssh doesn't seem to work on bsd, and some of my
;; remote shells don't use sh/bash.  ssh/sshx should also be faster than scp
(setq tramp-default-method "sshx")
#+END_SRC
* Tags

I have a custom configuration for ctags stored in [[file:~/.ctags][~/.ctags]] that works with some additional languages like terraform, and excludes a lot of things like =node_modules= and =.terraform/modules= which causes the tags file to be too large.

#+BEGIN_SRC emacs-lisp
;; Use my default ctags configuration which excludes a lot of things we don't want
(setq projectile-tags-command "ctags --options=~/.ctags -Re -f \"%s\" %s \"%s\"")
#+END_SRC
* evil-snipe

#+BEGIN_SRC emacs-lisp
(use-package! evil-snipe
  :defer t
  :config
  ;; Alias [ and ] to all types of brackets
  ;; With this, I can use evil-snipe by pressing f and then [ and it will search for any of these types of brackets
  (push '(?\[ "[[{(]") evil-snipe-aliases)
  (push '(?\] "[]})]") evil-snipe-aliases)
  (setq evil-snipe-scope 'visible)
  (setq evil-snipe-repeat-scope 'buffer)
  (setq evil-snipe-spillover-scope 'whole-buffer))
#+END_SRC
* Backups and history

#+BEGIN_SRC emacs-lisp
;; Save backups in one place
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))

;; TODO: I'm not sure if I need this anymore?  It was originally because of Nextcloud having issues with my .org files
;; Disable lock files
;; (setq create-lockfiles nil)
#+END_SRC

I was running into issues with Emacs using up 100% of my cpu for a while when it was basically idle.  One of the issues ended up being that there was no history limit, or it was really long.

#+BEGIN_SRC emacs-lisp
;; Try to prevent emacs from using 100% cpu due to autosave
;; See https://github.com/syl20bnr/spacemacs/issues/9409
(setq history-length 350)
(put 'minibuffer-history 'history-length 50)
(put 'evil-ex-history 'history-length 50)
(put 'kill-ring 'history-length 25)
#+END_SRC

From https://gitlab.com/justinekizhak/dotfiles/blob/master/emacs/doom.d/config.org
#+BEGIN_SRC emacs-lisp
(use-package! recentf
  :defer t
  :ensure nil
  :hook (after-init . recentf-mode)
  :custom
  (recentf-auto-cleanup "05:00am")
  (recentf-max-saved-items 200)
  (recentf-exclude '((expand-file-name package-user-dir)
                     ".cache"
                     ".cask"
                     ".elfeed"
                     "bookmarks"
                     "cache"
                     "ido.*"
                     "persp-confs"
                     "recentf"
                     "undo-tree-hist"
                     "url"
                     "COMMIT_EDITMSG\\'")))

;; When buffer is closed, saves the cursor location
(save-place-mode 1)
#+END_SRC
