doom.d/config.el



(setq org-capture-templates
      ;; TODO: Move some of these to a separate file not in git, since I don't need them in every computer
      '(("t" "Todo" entry (file+headline "~/org/TODO.org" "Tasks")
         "* TODO %?\nCREATED: %U\n%i\n%a")
        ("T" "Todo with Clipboard" entry (file+headline "~/org/TODO.org" "Tasks")
         "* TODO %?\nCREATED: %U\n%c"
         :empty-lines 1)
        ("r" "Read Later" entry (file+headline "~/org/TODO.org" "Read Later")
         "* TODO %?  :readlater:\nCREATED: %U")
        ("j" "Journal"
         entry (file+datetree "~/org/journal.org")
         "* %? \nCREATED: %U\n%i\n%a"
         :empty-lines 1)
        ;; TODO: Use year in filename automatically
        ("w" "New WorkLog entry"
         entry (file+datetree "~/org/worklog_2020.org")
         "* %? :work:\nCREATED: %T\n%i\n%a\n"
         :clock-in t
         :clock-resume t
         :empty-lines 1)
        ("W" "New Work Ticket"
         entry (file+datetree "~/org/worklog_2020.org")
         "* IN-PROGRESS %^{TicketID}: %^{Title} :work:ticket:
:PROPERTIES:
:ID: %\\1
:BI_ENVIRONMENT: %^{BI_ENVIRONMENT}
:BI_CUSTOMER: %^{BI_CUSTOMER}
:CREATED: %T
:END:\n%?"
         :clock-in t
         :clock-resume t
         :empty-lines 1)
        ("n" "Append timestamped note to clocked task"
         plain (clock)
         "%U %?"
         :empty-lines 1)
        ("m" "Meeting"
         entry (file+datetree "~/org/worklog_2020.org")
         "* Meeting for %^{Title} :work:meeting:\nCREATED: %T\nAgenda/Purpose: \nWho: \n\n - %?\n"
         :empty-lines 1
         :clock-in t
         :clock-resume t)
        ("M" "Adhoc Meeting(Chat/InPerson/Email/Etc)"
         entry (file+datetree "~/org/worklog_2020.org")
         "* Adhoc meeting w/ %^{Who} about %^{What} :work:meeting:\nCREATED: %T\nWho: %\\1 \nNotes: %?\n"
         :empty-lines 1
         :clock-in t
         :clock-resume t)
        ("f" "Todo - Follow-up later today on e-mail/slack/etc"
         entry (file+datetree "~/org/worklog_2020.org")
         "* NEXT [#A] %? :work:followup:\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\")) CREATED: %T\n"
         :empty-lines 1)
        ("v" "Code Reference with Comments to Current Task"
         plain (clock)
         "%?\n%(ha/org-capture-code-snippet \"%F\")\n\n"
         :empty-lines 1)
        ("V" "Link to Code Reference to Current Task"
         plain (clock)
         "%(ha/org-capture-code-snippet \"%F\")"
         :empty-lines 1 :immediate-finish t)
        ))

;; Add a small amount of extra space in between each line
(setq line-spacing 2)

(setq indent-tabs-mode nil
      tab-width 2)

(use-package! autorevert
  :defer t
  :ensure nil
  :config
  (global-auto-revert-mode +1)
  (setq auto-revert-interval 2
        auto-revert-check-vc-info t
        auto-revert-verbose nil))
