doom.d/config.el

(setq avy-all-windows t)
